In [32]:
! pip install pandas pandasql

Requirement already satisfied: pandas in c:\users\usuário\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: pandasql in c:\users\usuário\anaconda3\lib\site-packages (0.7.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\usuário\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\usuário\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\usuário\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\usuário\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: sqlalchemy in c:\users\usuário\anaconda3\lib\site-packages (from pandasql) (1.4.39)
Requirement already satisfied: six>=1.5 in c:\users\usuário\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\usuário\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (2.0.1)

In [33]:
import pandas as pd
import pandasql

In [34]:
base= pd.read_csv("C:/Users/Usuário/Downloads/archive (2)/projetoCase/Student_performance_data _.csv")

In [35]:
base.head()

,StudentID,Age,Gender,Ethnicity,ParentalEducation,StudyTimeWeekly,Absences,Tutoring,ParentalSupport,Extracurricular,Sports,Music,Volunteering,GPA,GradeClass
0,1001,17,1,0,2,19.833723,7,1,2,0,0,1,0,2.929196,2.0
1,1002,18,0,0,1,15.408756,0,0,1,0,0,0,0,3.042915,1.0
2,1003,15,0,2,3,4.210570,26,0,2,0,0,0,0,0.112602,4.0
3,1004,17,1,0,3,10.028829,14,0,3,1,0,0,0,2.054218,3.0
4,1005,17,1,0,2,4.672495,17,1,3,0,0,0,0,1.288061,4.0

In [36]:
! pip install pandasql

Requirement already satisfied: pandasql in c:\users\usuário\anaconda3\lib\site-packages (0.7.3)
Requirement already satisfied: numpy in c:\users\usuário\anaconda3\lib\site-packages (from pandasql) (1.24.3)
Requirement already satisfied: pandas in c:\users\usuário\anaconda3\lib\site-packages (from pandasql) (2.0.3)
Requirement already satisfied: sqlalchemy in c:\users\usuário\anaconda3\lib\site-packages (from pandasql) (1.4.39)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\usuário\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\usuário\anaconda3\lib\site-packages (from pandas->pandasql) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\usuário\anaconda3\lib\site-packages (from pandas->pandasql) (2023.3)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\usuário\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (2.0.1)
Requirement already satisfied: six>=1.5 in c:\users\usuário\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)

In [37]:
! pip show pandasql

Name: pandasql
Version: 0.7.3
Summary: sqldf for pandas
Home-page: https://github.com/yhat/pandasql/
Author: Greg Lamp
Author-email: greg@yhathq.com
License: Copyright (c) 2013 Yhat, Inc.

Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
Location: C:\Users\Usuário\anaconda3\Lib\site-packages
Requires: numpy, pandas, sqlalchemy
Required-by:

In [38]:
import pandas as pd
from pandasql import sqldf
import sqlite3

# Carregar o arquivo CSV em um DataFrame
base = pd.read_csv(r"C:\Users\Usuário\Downloads\archive (2)\projetoCase\Student_performance_data _.csv")

# Verificar se o DataFrame foi carregado corretamente
print(base.head())

# Criar uma conexão com um banco de dados SQLite em memória
conn = sqlite3.connect(':memory:')

# Carregar o DataFrame para o banco de dados SQLite
base.to_sql('base', conn, index=False, if_exists='replace')

# Definir a função lambda pysqldf para usar a conexão SQLite
pysqldf = lambda q: pd.read_sql_query(q, conn)

# Template da query
query = """
SELECT *
FROM base
"""

# Executar a query
resultado = pysqldf(query)
print(resultado)

# Fechar a conexão com o banco de dados

   StudentID  Age  Gender  Ethnicity  ParentalEducation  StudyTimeWeekly  \
0       1001   17       1          0                  2        19.833723
1       1002   18       0          0                  1        15.408756
2       1003   15       0          2                  3         4.210570
3       1004   17       1          0                  3        10.028829
4       1005   17       1          0                  2         4.672495

   Absences  Tutoring  ParentalSupport  Extracurricular  Sports  Music  \
0         7         1                2                0       0      1
1         0         0                1                0       0      0
2        26         0                2                0       0      0
3        14         0                3                1       0      0
4        17         1                3                0       0      0

   Volunteering       GPA  GradeClass
0             0  2.929196         2.0
1             0  3.042915         1.0
2             0  0.112602         4.0
3             0  2.054218         3.0
4             0  1.288061         4.0
      StudentID  Age  Gender  Ethnicity  ParentalEducation  StudyTimeWeekly  \
0          1001   17       1          0                  2        19.833723
1          1002   18       0          0                  1        15.408756
2          1003   15       0          2                  3         4.210570
3          1004   17       1          0                  3        10.028829
4          1005   17       1          0                  2         4.672495
...         ...  ...     ...        ...                ...              ...
2387       3388   18       1          0                  3        10.680555
2388       3389   17       0          0                  1         7.583217
2389       3390   16       1          0                  2         6.805500
2390       3391   16       1          1                  0        12.416653
2391       3392   16       1          0                  2        17.819907

      Absences  Tutoring  ParentalSupport  Extracurricular  Sports  Music  \
0            7         1                2                0       0      1
1            0         0                1                0       0      0
2           26         0                2                0       0      0
3           14         0                3                1       0      0
4           17         1                3                0       0      0
...        ...       ...              ...              ...     ...    ...
2387         2         0                4                1       0      0
2388         4         1                4                0       1      0
2389        20         0                2                0       0      0
2390        17         0                2                0       1      1
2391        13         0                2                0       0      0

      Volunteering       GPA  GradeClass
0                0  2.929196         2.0
1                0  3.042915         1.0
2                0  0.112602         4.0
3                0  2.054218         3.0
4                0  1.288061         4.0
...            ...       ...         ...
2387             0  3.455509         0.0
2388             0  3.279150         4.0
2389             1  1.142333         2.0
2390             0  1.803297         1.0
2391             1  2.140014         1.0

[2392 rows x 15 columns]

In [39]:
resultado

,StudentID,Age,Gender,Ethnicity,ParentalEducation,StudyTimeWeekly,Absences,Tutoring,ParentalSupport,Extracurricular,Sports,Music,Volunteering,GPA,GradeClass
0,1001,17,1,0,2,19.833723,7,1,2,0,0,1,0,2.929196,2.0
1,1002,18,0,0,1,15.408756,0,0,1,0,0,0,0,3.042915,1.0
2,1003,15,0,2,3,4.210570,26,0,2,0,0,0,0,0.112602,4.0
3,1004,17,1,0,3,10.028829,14,0,3,1,0,0,0,2.054218,3.0
4,1005,17,1,0,2,4.672495,17,1,3,0,0,0,0,1.288061,4.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2387,3388,18,1,0,3,10.680555,2,0,4,1,0,0,0,3.455509,0.0
2388,3389,17,0,0,1,7.583217,4,1,4,0,1,0,0,3.279150,4.0
2389,3390,16,1,0,2,6.805500,20,0,2,0,0,0,1,1.142333,2.0
2390,3391,16,1,1,0,12.416653,17,0,2,0,1,1,0,1.803297,1.0
2391,3392,16,1,0,2,17.819907,13,0,2,0,0,0,1,2.140014,1.0

In [40]:
#traga as colunas StudentId, Age , Gender, GPA , Absences e filtre apenas estudantes que tiveram menos de 11 faltas

# Template da query
query = """
SELECT StudentId, Age , Gender, GPA , Absences
FROM base
WHERE Absences <11;
"""

# Executar a query
resultado_menos11_faltas = pysqldf(query)
resultado_menos11_faltas  #845 linhas

     StudentID  Age  Gender       GPA  Absences
0         1001   17       1  2.929196         7
1         1002   18       0  3.042915         0
2         1006   18       0  3.084184         0
3         1007   15       0  2.748237        10
4         1009   17       0  2.896819         1
..         ...  ...     ...       ...       ...
840       3378   18       0  2.652355         8
841       3381   16       1  1.979379         8
842       3382   15       0  2.956255         5
843       3388   18       1  3.455509         2
844       3389   17       0  3.279150         4

[845 rows x 5 columns]

In [41]:


#qual a media dos estudantes que faltaram 10 vezes? ela é maior do que a média do resto da amostra
#vc acha que a media da nota dos estudantes pode estra relacionada a alguma variavl? explique

In [42]:
# substitua os valores da coluna gender por feminino e masculino
resultado_menos11_faltas['Gender']=resultado_menos11_faltas['Gender'].replace({0:'masculino',1:'feminino'})
resultado_menos11_faltas

     StudentID  Age     Gender       GPA  Absences
0         1001   17   feminino  2.929196         7
1         1002   18  masculino  3.042915         0
2         1006   18  masculino  3.084184         0
3         1007   15  masculino  2.748237        10
4         1009   17  masculino  2.896819         1
..         ...  ...        ...       ...       ...
840       3378   18  masculino  2.652355         8
841       3381   16   feminino  1.979379         8
842       3382   15  masculino  2.956255         5
843       3388   18   feminino  3.455509         2
844       3389   17  masculino  3.279150         4

[845 rows x 5 columns]

In [43]:
#desta amostra qual genero faltou mais?

# Template da query
query = """
SELECT SUM(Absences) AS soma_faltas
FROM base
GROUP BY Gender;
"""

# Executar a query
resultado_genero_faltouMais = pysqldf(query)
resultado_genero_faltouMais # genero femino faltou mais com 17.987 faltas

   soma_faltas
0        16796
1        17987

In [44]:
#qual a media dos estudantes que faltaram 10 vezes? 
# Template da query
query = """
SELECT AVG(GPA) AS media_estudantes_faltas_10
FROM base
WHERE Absences = 10;
"""

# Executar a query
resultado_MEDIA_ESTUDANTES = pysqldf(query)
resultado_MEDIA_ESTUDANTES

   media_estudantes_faltas_10
0                    2.440346

In [45]:
#ela é maior do que a média do resto da amostra?
# Resposta : a media dos estudantes que faltaram 10 vzs é de 2.44
# a media dos estudantes que faltaram + 10 vzs é de 1.38
#  a media dos estudantes que faltaram menos de 10 vzs é de 2.88 , logo os alunos que faltaram menos de 10 vzs tem média maior

# Template da query ## Média dos estudantes que faltaram menos ou mais de 10 vezes
query = """
SELECT AVG(GPA) AS media_estudantes_ComMenos_10_Faltas
FROM base
WHERE Absences < 10 ;
"""

# Executar a query
resultado_media_estudantes_FaltaramMenosOuMais10 = pysqldf(query)
resultado_media_estudantes_FaltaramMenosOuMais10

   media_estudantes_ComMenos_10_Faltas
0                             2.889258

In [46]:
# Template da query ## Média dos estudantes que faltaram menos ou mais de 10 vezes
query = """
SELECT AVG(GPA) AS media_estudantes_ComMais_10_Faltas
FROM base
WHERE Absences > 10 ;
"""

# Executar a query
resultado_media_estudantes_FaltaramMaisOuMais10 = pysqldf(query)
resultado_media_estudantes_FaltaramMaisOuMais10

   media_estudantes_ComMais_10_Faltas
0                            1.386915

In [ ]:
#Utilizando a base de dados utilizada no exercicio anterior faça:
## Cruze com a base de dados criada anteriormente e traga a informação da coluna StudyTimeWeekly apenas dos estudantes com as maiores notas por idade e genero. Dica as linhas que nao forem de estudantes com nota maxima por idade devem ser nulas!

# Subconsulta para encontrar a maior nota por idade e gênero
query = """


WITH MaxGPA AS (
    SELECT Age, Gender, MAX(GPA) AS MaxGPA
    FROM resultado_menos11_faltas
    GROUP BY Age, Gender
)
SELECT b.StudentID, b.Age, b.Gender, b.GPA, a.StudyTimeWeekly
FROM base b
JOIN MaxGPA m
ON b.Age = m.Age AND b.Gender = m.Gender AND b.GPA = m.MaxGPA
LEFT JOIN second_base a
ON b.StudentID = a.StudentID
"""

# Executar a query
resultado = pysqldf(query)
print(resultado)